InformationRegisters/ИА_Календарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_Календарь</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Рабочий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоРабочихЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_Календарь/Forms/ФормаЗаполнения_УПР/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыборПериода(Команда)
	
	Период  = Новый СтандартныйПериод(ДатаНачала,ДатаКонца);
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Период;
	
	Если Диалог.Редактировать() Тогда 
		
		Период = Диалог.Период;
		ДатаНачала = Период.ДатаНачала;
		ДатаКонца = Период.ДатаОкончания;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрКалендарь(Команда)
	
	Если Не ПериодЗаполнен() Тогда
		ПоказатьПредупреждение(,"Период не заполнен.");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоПрКалендарю();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоПрКалендарю()
	ИА_КСУОбщийСервер.Календарь_ЗаполнитьПоПрКалендарю(
    ДанныеДляЗагрузки
    ,ДатаНачала
    ,ДатаКонца
    ,КолРабочихЧасовПятница
    ,КолРабочихЧасов);
КонецПроцедуры

&НаКлиенте
Процедура Weekend(Команда)
	
	Если Не ПериодЗаполнен() Тогда
		ПоказатьПредупреждение(,"Период не заполнен.");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьWeekend();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьWeekend()
	
	мДниНедели = Новый Соответствие();
	мДниНедели.Вставить(1, "ПН");
	мДниНедели.Вставить(2, "ВТ");
	мДниНедели.Вставить(3, "СР");
	мДниНедели.Вставить(4, "ЧТ");
	мДниНедели.Вставить(5, "ПТ");
	мДниНедели.Вставить(6, "СБ");
	мДниНедели.Вставить(7, "ВС");
	
	ДанныеДляЗагрузки.Очистить();
	
	Дата = ДатаНачала;
	Пока Дата<=ДатаКонца Цикл
		Новстр = ДанныеДляЗагрузки.Добавить();
		Новстр.Период = Дата;
		дн = ДеньНедели(Новстр.Период);
		Новстр.ДеньНедели = мДниНедели[дн];
		Если (ДеньНедели(Дата) > 5) Тогда
			Новстр.Рабочий = Ложь;
		Иначе
			Новстр.Рабочий = Истина;
		КонецЕсли;
		
		Если Новстр.Рабочий Тогда
			Новстр.КоличествоРабочихЧасов = ?(дн = 5, КолРабочихЧасовПятница, КолРабочихЧасов)
		Иначе
			Новстр.КоличествоРабочихЧасов = 0;
		КонецЕсли;
		
		
		Дата = Дата + 86400;
	КонецЦикла;
	
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДляЗагрузкиПериодПриИзменении(Элемент)
	
	мДниНедели = Новый Соответствие();
	мДниНедели.Вставить(1, "ПН");
	мДниНедели.Вставить(2, "ВТ");
	мДниНедели.Вставить(3, "СР");
	мДниНедели.Вставить(4, "ЧТ");
	мДниНедели.Вставить(5, "ПТ");
	мДниНедели.Вставить(6, "СБ");
	мДниНедели.Вставить(7, "ВС");
	
	
	ТД = Элементы.ДанныеДляЗагрузки.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТД.ДеньНедели = мДниНедели[ДеньНедели(ТД.Период)];
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КолРабочихЧасов = 8;
	КолРабочихЧасовПятница = 8;
КонецПроцедуры

&НаКлиенте
Функция ПериодЗаполнен()
	Возврат ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаКонца);
КонецФункции

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаКлиенте();
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьНаКлиенте()	
	ЗаписатьНаСервере();
	Оповестить("ИА_Календарь_Изменен");
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Для каждого Стр Из ДанныеДляЗагрузки Цикл
		Мен = РегистрыСведений.ИА_Календарь.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Мен, Стр);
		Мен.Записать();
	КонецЦикла;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Если КалендарьУжеЗаполнен() Тогда
		ТекстВопроса = "Календарь на заданный период уже заполнен. Вы хотите перезаписать календарь?";
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаписатьИЗакрытьЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
        Возврат;
	КонецЕсли;

	ЗаписатьИЗакрытьФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьИЗакрытьФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьФрагмент()
	
	ЗаписатьНаКлиенте();
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), "Данные не записаны в календарь. Закрыть окно без записи данных?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
		Отказ = истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДанныеДляЗагрузкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Функция КалендарьУжеЗаполнен()
	
	мДат = ДанныеДляЗагрузки.Выгрузить().ВыгрузитьКолонку("Период");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИА_Календарь.Период
	|ИЗ
	|	РегистрСведений.ИА_Календарь КАК ИА_Календарь
	|ГДЕ
	|	ИА_Календарь.Период В (&мДат)";
	
	Запрос.УстановитьПараметр("мДат", мДат);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервере
Процедура ИзИнтернетаНаСервере()
	мДниНедели = Новый Соответствие();
	мДниНедели.Вставить(1, "ПН");
	мДниНедели.Вставить(2, "ВТ");
	мДниНедели.Вставить(3, "СР");
	мДниНедели.Вставить(4, "ЧТ");
	мДниНедели.Вставить(5, "ПТ");
	мДниНедели.Вставить(6, "СБ");
	мДниНедели.Вставить(7, "ВС");
	
	ДанныеДляЗагрузки.Очистить();
	
	Дата = ДатаНачала;
	
	ТекГод = Год(ДатаНачала);
	ГодКонец =  Год(ДатаКонца);
	
	Пока ТекГод <= ГодКонец Цикл
		Попытка
			имяФайла = КаталогВременныхФайлов() + "calendar.xml";
			КопироватьФайл("http://www.xmlcalendar.ru/data/ru/"+формат(ТекГод,"ЧГ=")+"/calendar.xml", имяФайла)
		Исключение
			Сообщить("За "+ТекГод+ " год нет данных.");
			ТекГод = ТекГод + 1;
			Продолжить;
		КонецПопытки;
		
		ОсобыеДни = Новый Соответствие;
		
		Файл = Новый ЧтениеXML;
		Файл.ОткрытьФайл(имяФайла);
		Пока Файл.Прочитать() Цикл
			Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.Имя = "day" Тогда
				день = Файл.ЗначениеАтрибута("d");
				Тип = число(Файл.ЗначениеАтрибута("t"));
				
				День = Дата(ТекГод, число(лев(день,2)), число(прав(день,2)));
				
				ОсобыеДни.Вставить(День, Тип);
			КонецЕсли;
		КонецЦикла;
		
		Файл.Закрыть();
		
		Пока Дата<=ДатаКонца и Год(Дата) = ТекГод Цикл
			Новстр = ДанныеДляЗагрузки.Добавить();
			Новстр.Период = Дата;
			дн = ДеньНедели(Новстр.Период);
			Новстр.ДеньНедели = мДниНедели[дн];
			Если (ДеньНедели(Дата) > 5) Тогда
				Новстр.Рабочий = Ложь;
			Иначе
				Новстр.Рабочий = Истина;
			КонецЕсли;
			
			Если Новстр.Рабочий Тогда
				Новстр.КоличествоРабочихЧасов = ?(дн = 5, КолРабочихЧасовПятница, КолРабочихЧасов)
			Иначе
				Новстр.КоличествоРабочихЧасов = 0;
			КонецЕсли;
			
			ТипДня = ОсобыеДни.Получить(Новстр.Период);
			Если ТипДня<>Неопределено Тогда
				Если ТипДня = 1 Тогда // выходной
					Новстр.Рабочий = Ложь;
					Новстр.КоличествоРабочихЧасов = 0;
				ИначеЕсли ТипДня = 2 Тогда // сокращенный
					Новстр.Рабочий = истина;
					Новстр.КоличествоРабочихЧасов = КолРабочихЧасов - 1;
				ИначеЕсли ТипДня = 3 Тогда // рабочий выходной
					Новстр.Рабочий = истина;
					Новстр.КоличествоРабочихЧасов = КолРабочихЧасов;
				КонецЕсли;
			КонецЕсли;
			
			Дата = Дата + 86400;
		КонецЦикла;
		
		ТекГод = ТекГод + 1;
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзИнтернета(Команда)
	ИзИнтернетаНаСервере();
КонецПроцедуры
